export const POWER_LIMIT = [
  ['固执己见', '中规中矩', '异想天开', '口无遮拦'],
  ['唯权力是同', '唯完美是同', '无可无不可', '以自我为中心'],
  ['善于支配', '富于同情', '宽容谅解', '热情澎湃'],
  ['自得自满', '疑神疑鬼', '多有保留', '天真无邪'],
  ['果断的', '忠诚的', '守分的', '戏谑的'],
  ['盛气凌人', '自寻烦恼', '沉默顽固', '轻浮游移'],
  ['武断的', '可靠的', '仁慈的', '活跃的'],
  ['颐指气使', '自我检讨', '懒得啰嗦', '喜欢捉弄'],
  ['行动派', '分析派', '随和派', '无忧派'],
  ['指责他人', '过分敏感', '羞羞答答', '叽叽呱呱'],
  ['自有决断', '顾虑细节', '善于聆听', '喜与众乐'],
  ['要求索取', '拒不原谅', '缺乏动机', '爱好虚荣'],
  ['负责任的', '有理想的', '体谅人的', '笑呵呵的'],
  ['不耐型', '情绪型', '被动型', '冲动型'],
  ['意志坚决', '毕恭毕敬', '耐心坚忍', '妙趣横生'],
  ['好争论', '超现实', '没头绪', '爱插嘴'],
  ['独立的', '可靠的', '平和的', '可信的'],
  ['积极', '抑郁', '矛盾', '忘仇'],
  ['强而有力', '细腻有致', '温柔憨厚', '风流乐观'],
  ['大而化之的', '好评断人的', '索然无味的', '没有纪律的'],
  ['逻辑性强的', '感性的', '亲和的', '容易与人打成一片'],
  ['总是对的', '常感内疚', '缺乏热忱', '不予承诺'],
  ['务实', '端庄', '逆来顺受', '自然'],
  ['铁石心肠', '深思远虑', '不愿涉入', '喜爱表现'],
  ['计划', '诚挚', '圆滑', '有生气'],
  ['不善迂回', '不易取悦', '慵懒不勤', '大声招徕'],
  ['直截了当', '充满创意', '适应性好', '天生演员'],
  ['处心积虑', '自以为是', '自我否决', '杂乱无章'],
  ['信心十足', '训练有素', '悦人悦己', '魅力十足'],
  ['容易担心', '仔细', '不易生产', '怕面对事实']
]

export const SITUATION = [
  {
    q: '我去求职，如果雇主肯用我，最可能的理由是因为我',
    v: [
      '有活力，直截了当，而且有鞭策力',
      '心思细腻，论事精确，而且为人可靠',
      '有耐心，适应性强，而且知道如何适应眼前状况',
      '妙趣横生，奕奕有神，而且一见如故'
    ]
  },
  {
    q: '在恋爱的亲密关系中，如果我感受到对方的威胁，我会',
    v: [
      '举出事实，反击之，而且发怒',
      '哭泣，觉得受伤，而且计划报复',
      '变得沉默、退缩、压抑怒气，下一次再借题爆发',
      '敬而远之，以避免进一步的冲突'
    ]
  },
  {
    q: '对我来说，生命最有意义的时刻，就在',
    v: [
      '工作按计划进行，效率高的时候',
      '人们熙熙攘攘，目的明确的时候',
      '没有压力，不觉得紧张的时候',
      '任我嬉戏、悠游，乐天的时候'
    ]
  },
  {
    q: '在我小时候，我是',
    v: [
      '倔强、聪明以及/或者进取',
      '乖巧关怀以及/或者忧郁',
      '静默、随遇而安以及/或者羞怯',
      '话太多、快乐以及/或者爱玩'
    ]
  },
  {
    q: '长大以后，我是',
    v: [
      '固执己见、有决心以及/或者颐指气使',
      '负责任、诚实以及/或者难得原谅人',
      '逆来顺受、自得以及/或者缺乏动机',
      '魅力十足、肯定以及/或者叽叽呱呱'
    ]
  },
  {
    q: '身为父母，我是',
    v: [
      '要求严厉、性急以及/或者不肯妥协',
      '关心、敏感以及/或者爱挑剔',
      '宽容、容易被说动以及/或者经常崩溃',
      '爱嬉戏、不严肃以及/或者不负责任'
    ]
  },
  {
    q: '与朋友争论时，我经常',
    v: [
      '事实俱在却死鸭子嘴硬',
      '关心对方的感受和原则',
      '沉默顽固、不爽以及/或者心思混乱没有头绪',
      '大嗓门、不爽以及/或者向对方妥协'
    ]
  },
  {
    q: '如果朋友有困难，我会',
    v: [
      '保护他，多方设法而且提议解决之道',
      '关切、投入、忠心耿耿——不论难题有多大',
      '支持他，有耐性，并且做一个好听众',
      '不做判断，乐观，并且轻描淡化其严重性'
    ]
  },
  {
    q: '当我做决定时，我是',
    v: [
      '武断、明确而且有逻辑性',
      '细腻、精准而且小心翼翼',
      '仿徨、畏缩而且勉为其难',
      '冲动、不甘心承诺其前后不一致'
    ]
  },
  {
    q: '当我失败时，我会',
    v: [
      '暗地自我批评，但是嘴硬而且辩驳不休',
      '愧疚、自我批评，而且容易沉溺在压抑中',
      '惊惶失措、害怕，但是不动声色',
      '觉得难堪、神经兮兮，但愿能挑之夭夭'
    ]
  },
  {
    q: '如果有人惹恼我时',
    v: [
      '我会冒火，并且精心策划快速的报仇方法',
      '我会深深感到伤害，觉得几无宽宥的可能。一般而言，连报仇都嫌太便宜对方',
      '我会暗地感到受伤，并筹谋报复，以及/或者完全避开那家伙',
      '我会避免摊牌，因为还不到值得的地步，以及/或者去找新朋友'
    ]
  },
  {
    q: '工作是',
    v: [
      '把时间花在最有回报上的方式',
      '健康的活动，要做就要把它做好，应该先工作，后游戏',
      '只要是我喜爱的，而且不必有完成压力的，那么他就是一项正面的活动',
      '心里不喜欢但是必须要做的，远远不如玩乐有趣'
    ]
  },
  {
    q: '在社交场合中我最常',
    v: ['使人畏惧', '受人钦慕', '受人保护', '被人忌妒']
  },
  {
    q: '在男女关系中，我最在意的是',
    v: [
      '得到认可，而且证明正确',
      '得到了解、欣赏和亲密',
      '得到尊重、宽宥和静谧',
      '被赞美，有情趣，而且觉得自由'
    ]
  },
  {
    q: '为了活的有意思，我寻求',
    v: [
      '探险、驾驭事物和作惊人之举',
      '安稳、创造性和有意义',
      '接纳和安全',
      '刺激、寓工作于娱乐以及他人的陪伴'
    ]
  }
]
